In [1]:
import pandas 
from pandas import Series,DataFrame
import numpy as np

In [2]:
# 一维数据结构, index 显式索引
s = Series(data=[1,2,3,4], index=['a', 'b', 'c', 'd'])

In [3]:
s[1], s.a

(2, 1)

In [4]:
# 取前几后几
s.head(3), s.tail(2)

(a    1
 b    2
 c    3
 dtype: int64,
 c    3
 d    4
 dtype: int64)

In [5]:
# 去重
s.unique()

array([1, 2, 3, 4], dtype=int64)

In [6]:
# 索引一致才能相加
s1 = Series([1,2,3], index=['a', 'b', 'c'])
s2 = Series([1,2,3], index=['a', 'd', 'c'])
s = s1+s2
s

a    2.0
b    NaN
c    6.0
d    NaN
dtype: float64

In [7]:
s.isnull()

a    False
b     True
c    False
d     True
dtype: bool

In [8]:
s.notnull()

a     True
b    False
c     True
d    False
dtype: bool

In [9]:
s[s.notnull()]

a    2.0
c    6.0
dtype: float64

In [10]:
# 二维Series
df = DataFrame(data=np.random.randint(0,100, size=(3,4)), index=['a', 'b', 'c'], columns=['A','B','C','D'])
df

    A   B   C   D
a  32  71  24  21
b  54  81  63  60
c  35   3  73  15

In [11]:
dic = {'张三':[100, 100, 100, 100], '李四':[10,10,10,10]}
df = DataFrame(data=dic, index=['语文', '数学', '英文', '理综'])
df

     张三  李四
语文  100  10
数学  100  10
英文  100  10
理综  100  10

In [12]:
# 取值
df['张三']

语文    100
数学    100
英文    100
理综    100
Name: 张三, dtype: int64

In [13]:
df.loc['语文']

张三    100
李四     10
Name: 语文, dtype: int64

In [14]:
df.iloc[2]

张三    100
李四     10
Name: 英文, dtype: int64

In [15]:
df.loc[['语文','英文'], '张三']

语文    100
英文    100
Name: 张三, dtype: int64

In [16]:
# 切片
df.iloc[0:2, 0:1]

     张三
语文  100
数学  100

In [17]:
import tushare as ts

df = ts.get_k_data('600519', start='1900-01-01')
df

本接口即将停止更新，请尽快使用Pro版接口：https://tushare.pro/document/2

            date      open     close      high       low     volume    code
0     2001-08-27     5.392     5.554     5.902     5.132  406318.00  600519
1     2001-08-28     5.467     5.759     5.781     5.407  129647.79  600519
2     2001-08-29     5.777     5.684     5.781     5.640   53252.75  600519
3     2001-08-30     5.668     5.796     5.860     5.624   48013.06  600519
4     2001-08-31     5.804     5.782     5.877     5.749   23231.48  600519
...          ...       ...       ...       ...       ...        ...     ...
4508  2020-07-20  1652.500  1636.960  1663.990  1588.880   45280.00  600519
4509  2020-07-21  1646.640  1668.000  1702.800  1630.990   41970.00  600519
4510  2020-07-22  1658.000  1678.080  1710.000  1658.000   39201.00  600519
4511  2020-07-23  1672.000  1676.000  1691.000  1650.000   34321.00  600519
4512  2020-07-24  1654.850  1595.300  1666.000  1585.000   78752.00  600519

[4513 rows x 7 columns]

In [18]:
# 保存,读取
df.to_csv('./df.csv')
df = pandas.read_csv('./df.csv', index_col='date', parse_dates=['date'])
df

,Unnamed: 0,open,close,high,low,volume,code
date,,,,,,,
2001-08-27,0,5.392,5.554,5.902,5.132,406318.00,600519
2001-08-28,1,5.467,5.759,5.781,5.407,129647.79,600519
2001-08-29,2,5.777,5.684,5.781,5.640,53252.75,600519
2001-08-30,3,5.668,5.796,5.860,5.624,48013.06,600519
2001-08-31,4,5.804,5.782,5.877,5.749,23231.48,600519
...,...,...,...,...,...,...,...
2020-07-20,4508,1652.500,1636.960,1663.990,1588.880,45280.00,600519
2020-07-21,4509,1646.640,1668.000,1702.800,1630.990,41970.00,600519
2020-07-22,4510,1658.000,1678.080,1710.000,1658.000,39201.00,600519
2020-07-23,4511,1672.000,1676.000,1691.000,1650.000,34321.00,600519
2020-07-24,4512,1654.850,1595.300,1666.000,1585.000,78752.00,600519

In [19]:
# 输出改股票所有收盘比开盘上涨3%以上的日期
df.loc[(df['close']-df['open'])/df['open'] > 0.03]

,Unnamed: 0,open,close,high,low,volume,code
date,,,,,,,
2001-08-27,0,5.392,5.554,5.902,5.132,406318.00,600519
2001-08-28,1,5.467,5.759,5.781,5.407,129647.79,600519
2001-09-10,10,5.531,5.734,5.757,5.470,18878.89,600519
2001-12-21,79,5.421,5.604,5.620,5.421,8135.04,600519
2002-01-18,96,5.437,5.726,5.762,5.421,32262.08,600519
...,...,...,...,...,...,...,...
2020-05-18,4465,1306.000,1346.210,1351.500,1305.130,34362.00,600519
2020-07-02,4496,1499.000,1544.000,1550.900,1495.000,45884.00,600519
2020-07-06,4498,1538.000,1600.000,1616.000,1531.810,51822.00,600519
2020-07-07,4499,1603.090,1688.000,1744.820,1601.000,66664.00,600519
2020-07-13,4503,1714.680,1781.990,1787.000,1714.680,60727.00,600519

In [20]:
# 输出该股票所有开盘比前日收盘跌幅超过2%的日期
df.loc[(df['open']-df['close'].shift(1))/df['close'].shift(1) < -0.02]

,Unnamed: 0,open,close,high,low,volume,code
date,,,,,,,
2001-09-12,12,5.520,5.621,5.656,5.515,25045.19,600519
2002-06-26,192,5.824,5.757,5.843,5.712,15423.00,600519
2002-12-13,307,4.508,4.628,4.670,4.508,2223.10,600519
2004-07-01,674,6.357,6.792,6.810,6.355,2781.62,600519
2004-10-29,755,9.658,9.899,9.986,9.658,14363.14,600519
...,...,...,...,...,...,...,...
2019-10-16,4323,1168.000,1170.000,1187.500,1160.000,59150.00,600519
2020-01-02,4378,1128.000,1130.000,1145.060,1116.000,148099.00,600519
2020-02-03,4394,985.000,1003.920,1010.680,980.000,123442.00,600519
2020-03-13,4423,1090.000,1112.030,1128.980,1080.000,75885.00,600519
2020-03-23,4429,1000.000,1019.000,1035.280,991.520,48472.00,600519

In [21]:
# 从2010一月一日开始,每月第一个交易日买入一手股票,每年最后一个交易日卖出所有股票,至今收益?
df_new = df['2010':'2020'].resample('M').first()
buy = df_new['open'].sum()*100
sale = df['2010':'2020'].resample('A').last()[:-1]['open'].sum()*1200
sale
keep = df.iloc[-1]['close'] * 900
profit = sale+keep-buy
profit

1167037.6999999993

In [39]:
df = DataFrame(data=np.random.randint(0, 100, size=(8, 10)))
df

    0   1   2   3   4   5   6   7   8   9
0   2  74  37  84  92  32  54  78  21  35
1  42  36  20  75  51  88  59   1  23  32
2  11  24  19  69   6  19  52  11  38  14
3  78  37  91  88  51  59  20  51  79   8
4   2  14  47  39  70   2  89  92  38   9
5  27  76  58  25  46  43  66  18  96  23
6  25  93   9  90  32  28  98  65  28  48
7  12  46  15   3  94  23  26  23  82  60

In [40]:
df.iloc[1, 2] = None
df.iloc[2, 3] = None
df.iloc[3, 4] = None
# None转换为NaN(np.nan)
df

    0   1     2     3     4   5   6   7   8   9
0   2  74  37.0  84.0  92.0  32  54  78  21  35
1  42  36   NaN  75.0  51.0  88  59   1  23  32
2  11  24  19.0   NaN   6.0  19  52  11  38  14
3  78  37  91.0  88.0   NaN  59  20  51  79   8
4   2  14  47.0  39.0  70.0   2  89  92  38   9
5  27  76  58.0  25.0  46.0  43  66  18  96  23
6  25  93   9.0  90.0  32.0  28  98  65  28  48
7  12  46  15.0   3.0  94.0  23  26  23  82  60

In [45]:
# 筛选空行
df.isnull().any(axis=1)
df.notnull().all(axis=1)
df[df.notnull().all(axis=1)]

    0   1     2     3     4   5   6   7   8   9
0   2  74  37.0  84.0  92.0  32  54  78  21  35
4   2  14  47.0  39.0  70.0   2  89  92  38   9
5  27  76  58.0  25.0  46.0  43  66  18  96  23
6  25  93   9.0  90.0  32.0  28  98  65  28  48
7  12  46  15.0   3.0  94.0  23  26  23  82  60

In [47]:
# 删除空行, axis=0 行
df.dropna(axis=0)

    0   1   5   6   7   8   9
0   2  74  32  54  78  21  35
1  42  36  88  59   1  23  32
2  11  24  19  52  11  38  14
3  78  37  59  20  51  79   8
4   2  14   2  89  92  38   9
5  27  76  43  66  18  96  23
6  25  93  28  98  65  28  48
7  12  46  23  26  23  82  60

In [50]:
# 填充空值, 向前覆盖
df.fillna(method='ffill', axis=1)
# 向后覆盖
df.fillna(method='bfill', axis=1)

      0     1     2     3     4     5     6     7     8     9
0   2.0  74.0  37.0  84.0  92.0  32.0  54.0  78.0  21.0  35.0
1  42.0  36.0  75.0  75.0  51.0  88.0  59.0   1.0  23.0  32.0
2  11.0  24.0  19.0   6.0   6.0  19.0  52.0  11.0  38.0  14.0
3  78.0  37.0  91.0  88.0  59.0  59.0  20.0  51.0  79.0   8.0
4   2.0  14.0  47.0  39.0  70.0   2.0  89.0  92.0  38.0   9.0
5  27.0  76.0  58.0  25.0  46.0  43.0  66.0  18.0  96.0  23.0
6  25.0  93.0   9.0  90.0  32.0  28.0  98.0  65.0  28.0  48.0
7  12.0  46.0  15.0   3.0  94.0  23.0  26.0  23.0  82.0  60.0

In [60]:
# 映射
dic = {2:'200', 42:'4200'}
df['map'] = df[0].map(dic)
df

    0   1     2     3     4   5   6   7   8   9  add   map
0   2  74  37.0  84.0  92.0  32  54  78  21  35  102   200
1  42  36   NaN  75.0  51.0  88  59   1  23  32  142  4200
2  11  24  19.0   NaN   6.0  19  52  11  38  14  111   NaN
3  78  37  91.0  88.0   NaN  59  20  51  79   8  178   NaN
4   2  14  47.0  39.0  70.0   2  89  92  38   9  102   200
5  27  76  58.0  25.0  46.0  43  66  18  96  23  127   NaN
6  25  93   9.0  90.0  32.0  28  98  65  28  48  125   NaN
7  12  46  15.0   3.0  94.0  23  26  23  82  60  112   NaN

In [57]:
# 运算
df[0].apply(lambda x: x+100)
df['add'] = df[0].map(lambda x: x+100)
df

    0   1     2     3     4   5   6   7   8   9  add
0   2  74  37.0  84.0  92.0  32  54  78  21  35  102
1  42  36   NaN  75.0  51.0  88  59   1  23  32  142
2  11  24  19.0   NaN   6.0  19  52  11  38  14  111
3  78  37  91.0  88.0   NaN  59  20  51  79   8  178
4   2  14  47.0  39.0  70.0   2  89  92  38   9  102
5  27  76  58.0  25.0  46.0  43  66  18  96  23  127
6  25  93   9.0  90.0  32.0  28  98  65  28  48  125
7  12  46  15.0   3.0  94.0  23  26  23  82  60  112

In [63]:
df = DataFrame(data=np.random.random(size=(1000, 3)), columns=['a', 'b', 'c'])
df

            a         b         c
0    0.729907  0.875470  0.241099
1    0.543633  0.765294  0.368737
2    0.598091  0.384426  0.188055
3    0.465610  0.248097  0.222902
4    0.301766  0.186580  0.350080
..        ...       ...       ...
995  0.534297  0.007793  0.346549
996  0.762335  0.414228  0.511494
997  0.208335  0.401048  0.372792
998  0.513869  0.631039  0.452512
999  0.925831  0.368746  0.158607

[1000 rows x 3 columns]

In [72]:
# 去除标准差太大的数据,条件为c列数据大于两倍的c列标准差
indexs = df.loc[df['c'] > df['c'].std()*2].index
df.drop(labels=indexs, axis=0, inplace=True)
df

            a         b         c
0    0.729907  0.875470  0.241099
2    0.598091  0.384426  0.188055
3    0.465610  0.248097  0.222902
10   0.339015  0.286586  0.022692
18   0.666568  0.574969  0.125105
..        ...       ...       ...
988  0.159592  0.223443  0.209405
991  0.521935  0.772710  0.078606
992  0.709010  0.577312  0.107621
993  0.191404  0.920769  0.311089
999  0.925831  0.368746  0.158607

[329 rows x 3 columns]

In [ ]:
# 清洗重复值
# df.drop_duplicates()

In [77]:
# 排序
df
df.take(np.random.permutation(3),axis=1,)

            b         a         c
0    0.875470  0.729907  0.241099
2    0.384426  0.598091  0.188055
3    0.248097  0.465610  0.222902
10   0.286586  0.339015  0.022692
18   0.574969  0.666568  0.125105
..        ...       ...       ...
988  0.223443  0.159592  0.209405
991  0.772710  0.521935  0.078606
992  0.577312  0.709010  0.107621
993  0.920769  0.191404  0.311089
999  0.368746  0.925831  0.158607

[329 rows x 3 columns]

In [80]:
# 分组
# df.groupby(by='b', axis=0).groups